# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'dockutil'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'trash'
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'imagemagick'
brew 'mariadb'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'pkg-config'
brew 'redis'

# Apps
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'caffeine'
cask 'calibre'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'gitkraken'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'qbittorrent'
cask 'skyfonts'
cask 'sequel-pro'
cask 'shuttle'
cask 'spectacle'
cask 'spotify'
cask 'transmit'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Bitwarden', id: 1352778147
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Sip', id: 507257563
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
