tap "appwrite/sdk-for-cli", "https://github.com/appwrite/sdk-for-cli"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "imxieyi/waifu2x"
tap "nicoverbruggen/cask"
tap "shopify/shopify"
tap "teamookla/speedtest"

brew "jpeg-xl"
brew "aria2"
brew "bash"
brew "bore-cli"
brew "glib"
brew "curl"
brew "libpq"
brew "openldap"
brew "php", restart_service: true
brew "composer"
brew "coreutils"
brew "deno"
brew "dnsmasq", restart_service: true
brew "dockutil"
brew "eza"
brew "unbound"
brew "harfbuzz"
brew "srt"
brew "ffmpeg"
brew "gh"
brew "gifsicle"
brew "git"
brew "gnupg"
brew "go"
brew "pkg-config"
brew "gobject-introspection"
brew "grep"
brew "httpie"
brew "libheif"
brew "imagemagick"
brew "iperf3"
brew "jpegoptim"
brew "mackup"
brew "mas"
brew "megatools"
brew "nvm"
brew "optipng"
brew "pngquant"
brew "podman"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "ruby"
brew "speedtest-cli"
brew "subversion"
brew "telnet"
brew "thefuck"
brew "tmux"
brew "tree"
brew "zoxide"
brew "zsh-completions"
brew "appwrite/sdk-for-cli/appwrite", args: ["HEAD"]
brew "shopify/shopify/shopify-cli"

cask "anytype"
cask "appcleaner"
cask "bruno"
cask "caffeine"
cask "cakebrew"
cask "calibre"
cask "dbngin"
cask "discord"
cask "dropbox"
cask "figma"
cask "firefox@developer-edition"
cask "folx"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "handbrake"
cask "hiddenbar"
cask "imageoptim"
cask "keka"
cask "lm-studio"
cask "maccy"
cask "microsoft-edge"
cask "microsoft-teams"
cask "mongodb-compass"
cask "monitorcontrol"
cask "moonlight"
cask "nordvpn"
cask "nvidia-geforce-now"
cask "obsidian"
cask "ogdesign-eagle"
cask "orion"
cask "podman-desktop"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "raindropio"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "shuttle"
cask "skyfonts"
cask "slack"
cask "soundsource"
cask "sourcetree"
cask "spotify"
cask "stats"
cask "steam"
cask "stremio"
cask "tableplus"
cask "the-unarchiver"
cask "transmission"
cask "transmit"
cask "visual-studio-code"
cask "warp"
cask "webtorrent"
cask "whisky"
cask "zoom"

mas "Canary Mail", id: 1236045954
mas "Dropover", id: 1355679052
mas "Eagle for Safari", id: 1526651672
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "Keynote", id: 409183694
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Save to Matter", id: 1548677272
mas "Save to Raindrop.io", id: 1549370672
mas "Sip", id: 507257563
mas "Xcode", id: 497799835

vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.path-intellisense"
vscode "codeforge.remix-forge"
vscode "codeium.codeium"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dnlytras.nord-wave"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "fivethree.vscode-svelte-snippets"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "heybourn.headwind"
vscode "hossaini.bootstrap-intellisense"
vscode "kenhowardpdx.vscode-gist"
vscode "kevinrose.vsc-python-indent"
vscode "laurencebahiirwa.deno-std-lib-snippets"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "mehedidracula.php-namespace-resolver"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "patbenatar.advanced-new-file"
vscode "pcbowers.alpine-intellisense"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "ryu1kn.partial-diff"
vscode "shopify.theme-check-vscode"
vscode "shufo.vscode-blade-formatter"
vscode "steoates.autoimport"
vscode "stivo.tailwind-fold"
vscode "svelte.svelte-vscode"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wallabyjs.console-ninja"
vscode "wcwhitehead.bootstrap-3-snippets"
vscode "wware.snippet-creator"
vscode "yzhang.markdown-all-in-one"
