tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nicoverbruggen/cask"

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'dockutil' # Used to manage the dock
brew 'gh' # GitHub CLI
brew 'git' # Latest Git version
brew 'gnupg' # GPG key management
brew 'grep' # Latest grep version
brew 'httpie' # Modern command line HTTP client
brew 'mackup' # Sync your application settings
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'thefuck' # Corrects your previous console command
brew 'svn' # Needed to install fonts

# Development
brew 'docker'
brew 'nvm' # Node version management
brew 'php'
brew 'pyenv' # Python version management
brew 'ruby'

# Applications
cask "appcleaner"
cask "caffeine" # Prevents your Mac from going to sleep
cask "cakebrew" # GUI for Homebrew
cask "calibre"
cask "dbngin" # Database management
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox-developer-edition"
cask "folx" # Download manager
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "gitkraken"
cask "google-chrome"
cask "hiddenbar" # Hide menu bar items
cask "imageoptim" # Image compression
cask "insomnia" # REST API client
cask "keka" # Archive manager
cask "maccy" # Clipboard manager
cask "monitorcontrol" # Control external monitors
cask "obsidian"
cask "ogdesign-eagle"
cask "qlmarkdown" # Quicklook plugin for Markdown files
cask "quicklook-csv" # Quicklook plugin for CSV files
cask "quicklook-json" # Quicklook plugin for JSON files
cask "raindropio"
cask "raycast" # Spotlight alternative
cask "rectangle" # Window management
cask "shottr" # Screenshot tool
cask "shuttle" # Shortcut manager
cask "skyfonts"
cask "slack"
cask "spotify"
cask "steam"
cask "tableplus" # Database management
cask "transmission" # Torrent client
cask "visual-studio-code"
cask "warp" # Terminal emulator
cask "wrike" # Project management

mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sip", id: 507257563
