# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'dockutil'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'python' 
brew 'composer'
brew 'imagemagick'
brew 'node'
brew 'yarn'

# Apps
cask 'appcleaner'
cask 'bartender'
cask 'caffeine'
cask 'calibre'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'gitkraken'
cask 'google-chrome'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'pastebot'
cask 'shuttle'
cask 'skyfonts'
cask 'spotify'
cask 'the-unarchiver'
# cask 'tinkerwell'
cask 'transmit'
# cask 'tunnelbear'
cask 'visual-studio-code'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Sip', id: 507257563
mas 'Magnet', id: 441258766
# mas 'Xcode', id: 497799835
