tap "felixkratz/formulae"
tap "nikitabobko/aerospace"
tap "oven-sh/bun"
tap "sst/tap"
brew "bat"
brew "btop"
brew "composer"
brew "dockutil"
brew "dust"
brew "eza"
brew "fd"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "hyperfine"
brew "jq"
brew "just"
brew "lazygit"
brew "python@3.13"
brew "luarocks"
brew "mas"
brew "neovim"
brew "node"
brew "nowplaying-cli"
brew "podman"
brew "podman-compose"
brew "procs"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "spicetify-cli"
brew "starship"
brew "switchaudio-osx"
brew "tmux"
brew "topgrade"
brew "wget"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"
brew "oven-sh/bun/bun"
brew "sst/tap/opencode"
cask "aerospace"
cask "anytype"
cask "appcleaner"
cask "bruno"
cask "discord"
cask "figma"
cask "firefox@developer-edition"
cask "folx"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "hiddenbar"
cask "keka"
cask "kitty"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "obsidian"
cask "ogdesign-eagle"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "wezterm"
mas "Canary Mail", id: 1236045954
mas "Dropover", id: 1355679052
mas "Eagle for Safari", id: 1526651672
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
